test/k6/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test/k6/load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m01.0s/1m0s

running (0m02.0s), 50/50 VUs, 27 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m02.0s/1m0s

running (0m03.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m03.0s/1m0s

running (0m04.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m04.0s/1m0s

running (0m05.0s), 50/50 VUs, 103 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m05.0s/1m0s

running (0m06.0s), 50/50 VUs, 153 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m06.0s/1m0s

running (0m07.0s), 50/50 VUs, 153 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m07.0s/1m0s

running (0m08.0s), 50/50 VUs, 172 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m08.0s/1m0s

running (0m09.0s), 50/50 VUs, 203 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m09.0s/1m0s

running (0m10.0s), 50/50 VUs, 222 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m10.0s/1m0s

running (0m11.0s), 50/50 VUs, 265 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m11.0s/1m0s

running (0m12.0s), 50/50 VUs, 304 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m12.0s/1m0s

running (0m13.0s), 50/50 VUs, 322 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m13.0s/1m0s

running (0m14.0s), 50/50 VUs, 372 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  0m14.0s/1m0s

running (0m15.1s), 50/50 VUs, 372 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  0m15.0s/1m0s

running (0m16.1s), 50/50 VUs, 422 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m16.0s/1m0s

running (0m17.1s), 50/50 VUs, 422 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  0m17.0s/1m0s

running (0m18.1s), 50/50 VUs, 472 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  0m18.0s/1m0s

running (0m19.1s), 50/50 VUs, 475 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m19.0s/1m0s

running (0m20.1s), 50/50 VUs, 522 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  0m20.0s/1m0s

running (0m21.1s), 50/50 VUs, 525 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  0m21.0s/1m0s

running (0m22.1s), 50/50 VUs, 575 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m22.0s/1m0s

running (0m23.1s), 50/50 VUs, 576 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  0m23.0s/1m0s

running (0m24.1s), 50/50 VUs, 626 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  0m24.0s/1m0s

running (0m25.1s), 50/50 VUs, 629 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m25.0s/1m0s

running (0m26.1s), 50/50 VUs, 679 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  0m26.0s/1m0s

running (0m27.1s), 50/50 VUs, 729 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  0m27.0s/1m0s

running (0m28.1s), 50/50 VUs, 729 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m28.0s/1m0s

running (0m29.1s), 50/50 VUs, 779 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  0m29.0s/1m0s

running (0m30.1s), 50/50 VUs, 779 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  0m30.0s/1m0s

running (0m31.1s), 50/50 VUs, 829 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  0m31.0s/1m0s

running (0m32.1s), 50/50 VUs, 829 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  0m32.0s/1m0s

running (0m33.1s), 50/50 VUs, 879 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  0m33.0s/1m0s

running (0m34.1s), 50/50 VUs, 929 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  0m34.0s/1m0s

running (0m35.1s), 50/50 VUs, 931 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  0m35.0s/1m0s

running (0m36.1s), 50/50 VUs, 981 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  0m36.0s/1m0s

running (0m37.1s), 50/50 VUs, 981 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  0m37.0s/1m0s

running (0m38.1s), 50/50 VUs, 1031 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  0m38.0s/1m0s

running (0m39.1s), 50/50 VUs, 1036 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  0m39.0s/1m0s

running (0m40.1s), 50/50 VUs, 1086 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  0m40.0s/1m0s

running (0m41.1s), 50/50 VUs, 1099 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  0m41.0s/1m0s

running (0m42.1s), 50/50 VUs, 1149 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  0m42.0s/1m0s

running (0m43.1s), 50/50 VUs, 1199 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  0m43.0s/1m0s

running (0m44.1s), 50/50 VUs, 1199 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  0m44.0s/1m0s

running (0m45.2s), 50/50 VUs, 1249 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  0m45.0s/1m0s

running (0m46.2s), 50/50 VUs, 1268 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  0m46.0s/1m0s

running (0m47.2s), 50/50 VUs, 1299 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  0m47.0s/1m0s

running (0m48.2s), 50/50 VUs, 1349 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  0m48.0s/1m0s

running (0m49.2s), 50/50 VUs, 1349 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  0m49.0s/1m0s

running (0m50.2s), 50/50 VUs, 1399 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  0m50.0s/1m0s

running (0m51.2s), 50/50 VUs, 1418 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  0m51.0s/1m0s

running (0m52.2s), 50/50 VUs, 1468 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  0m52.0s/1m0s

running (0m53.2s), 50/50 VUs, 1518 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  0m53.0s/1m0s

running (0m54.2s), 50/50 VUs, 1518 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  0m54.0s/1m0s

running (0m55.2s), 50/50 VUs, 1568 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  0m55.0s/1m0s

running (0m56.2s), 50/50 VUs, 1603 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  0m56.0s/1m0s

running (0m57.2s), 50/50 VUs, 1622 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  0m57.0s/1m0s

running (0m58.2s), 50/50 VUs, 1672 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  0m58.0s/1m0s

running (0m59.2s), 50/50 VUs, 1688 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  0m59.0s/1m0s

running (1m00.2s), 50/50 VUs, 1738 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  1m00.0s/1m0s

running (1m01.2s), 16/50 VUs, 1772 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  1m0s

     ✓ homepage status is 200
     ✗ homepage loads in < 500ms
      ↳  97% — ✓ 1739 / ✗ 49
     ✓ recent topics status is 200
     ✗ recent topics loads in < 500ms
      ↳  99% — ✓ 1776 / ✗ 12
     ✓ popular topics status is 200
     ✓ categories status is 200
     ✓ categories loads in < 500ms
     ✓ api/recent status is 200
     ✓ api responds in < 300ms

     checks.........................: 99.62% 16031 out of 16092
     data_received..................: 623 MB 10 MB/s
     data_sent......................: 1.5 MB 25 kB/s
     http_req_blocked...............: avg=25.61µs  min=1.17µs  med=3.35µs   max=4.89ms   p(90)=5.8µs    p(95)=6.98µs  
     http_req_connecting............: avg=8.45µs   min=0s      med=0s       max=2.7ms    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=139.62ms min=3.61ms  med=135.09ms max=828.81ms p(90)=223.02ms p(95)=254.25ms
       { expected_response:true }...: avg=139.62ms min=3.61ms  med=135.09ms max=828.81ms p(90)=223.02ms p(95)=254.25ms
     http_req_failed................: 0.00%  0 out of 8940
     http_req_receiving.............: avg=15.12ms  min=72.61µs med=10.93ms  max=226.12ms p(90)=32.07ms  p(95)=42.54ms 
     http_req_sending...............: avg=22.45µs  min=4.24µs  med=10.43µs  max=2.53ms   p(90)=18.29µs  p(95)=25.49µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=124.47ms min=3.23ms  med=115.29ms max=801.22ms p(90)=207.68ms p(95)=234.74ms
     http_reqs......................: 8940   146.013655/s
     iteration_duration.............: avg=1.69s    min=1.02s   med=1.74s    max=2.7s     p(90)=1.96s    p(95)=2s      
     iterations.....................: 1788   29.202731/s
     vus............................: 16     min=16             max=50
     vus_max........................: 50     min=50             max=50


running (1m01.2s), 00/50 VUs, 1788 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  1m0s